# 라이브러리 로드

In [1333]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn
import warnings
import numpy as np 
import pandas as pd
import category_encoders as ce
warnings.filterwarnings('ignore')

# 데이터 로드

In [1334]:
train = pd.read_csv("C:\project\datapre\.venv\Data Engineering\Data\kaggle_competition\\train.csv")
test = pd.read_csv("C:\project\datapre\.venv\Data Engineering\Data\kaggle_competition\\test.csv")
submission = pd.read_csv("C:\project\datapre\.venv\Data Engineering\Data\kaggle_competition\\submission.csv")

## train data

In [1335]:
train.head()

,passengerid,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,0,2,"Wheeler, Mr. Edwin Frederick""""",male,NaN,0,0,SC/PARIS 2159,12.8750,NaN,S
1,1,0,3,"Henry, Miss. Delia",female,NaN,0,0,382649,7.7500,NaN,Q
2,2,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S
3,3,1,3,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,27.0,0,0,350043,7.7958,NaN,S
4,4,0,2,"Hold, Mr. Stephen",male,44.0,1,0,26707,26.0000,NaN,S

In [1336]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 916 entries, 0 to 915
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  916 non-null    int64
 1   survived     916 non-null    int64
 2   pclass       916 non-null    int64
 3   name         916 non-null    object
 4   gender       916 non-null    object
 5   age          736 non-null    float64
 6   sibsp        916 non-null    int64
 7   parch        916 non-null    int64
 8   ticket       916 non-null    object
 9   fare         916 non-null    float64
 10  cabin        198 non-null    object
 11  embarked     915 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 86.0+ KB

In [1337]:
train.shape

(916, 12)

## test data

In [1338]:
test.head()

,passengerid,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,916,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
1,917,2,"Pinsky, Mrs. (Rosa)",female,32.0,0,0,234604,13.0000,NaN,S
2,918,3,"McCarthy, Miss. Catherine Katie""""",female,NaN,0,0,383123,7.7500,NaN,Q
3,919,3,"Franklin, Mr. Charles (Charles Fardon)",male,NaN,0,0,SOTON/O.Q. 3101314,7.2500,NaN,S
4,920,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S

In [1339]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 393 entries, 0 to 392
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  393 non-null    int64
 1   pclass       393 non-null    int64
 2   name         393 non-null    object
 3   gender       393 non-null    object
 4   age          310 non-null    float64
 5   sibsp        393 non-null    int64
 6   parch        393 non-null    int64
 7   ticket       393 non-null    object
 8   fare         392 non-null    float64
 9   cabin        97 non-null     object
 10  embarked     392 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 33.9+ KB

In [1340]:
test.shape

(393, 11)

## submission data

In [1341]:
submission.head()

   passengerid  survived
0          916       0.5
1          917       0.5
2          918       0.5
3          919       0.5
4          920       0.5

In [1342]:
submission.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 393 entries, 0 to 392
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  393 non-null    int64
 1   survived     393 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 6.3 KB

In [1343]:
submission.shape

(393, 2)

# EDA // 기본 정보

In [1344]:
o_train = pd.read_csv("C:\project\datapre\.venv\Data Engineering\Data\kaggle_competition\\train.csv")
o_test = pd.read_csv("C:\project\datapre\.venv\Data Engineering\Data\kaggle_competition\\test.csv")

In [1345]:
age_mean = o_train['age'].mean()
fare_mean = o_train['fare'].mean()
cabin_mode = o_train['cabin'].mode().values[0]
embarked_mode = o_train['embarked'].mode().values[0]


age_mean, fare_mean, cabin_mode, embarked_mode

(29.69836956521739, 32.40271048034934, 'B57 B59 B63 B66', 'S')

In [1346]:
o_train['age'].fillna(age_mean, inplace=True)
o_test['age'].fillna(age_mean, inplace=True)

o_train['fare'].fillna(fare_mean, inplace=True)
o_test['fare'].fillna(fare_mean, inplace=True)

o_train['cabin'].fillna(cabin_mode, inplace=True)
o_test['cabin'].fillna(cabin_mode, inplace=True)

o_train['embarked'].fillna(embarked_mode, inplace=True)
o_test['embarked'].fillna(embarked_mode, inplace=True)

o_train.isnull().sum().sum(), o_test.isnull().sum().sum()

(0, 0)

In [1347]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 916 entries, 0 to 915
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  916 non-null    int64
 1   survived     916 non-null    int64
 2   pclass       916 non-null    int64
 3   name         916 non-null    object
 4   gender       916 non-null    object
 5   age          736 non-null    float64
 6   sibsp        916 non-null    int64
 7   parch        916 non-null    int64
 8   ticket       916 non-null    object
 9   fare         916 non-null    float64
 10  cabin        198 non-null    object
 11  embarked     915 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 86.0+ KB

In [1348]:
train.head(), test.head()

(   passengerid  survived  pclass  \
 0            0         0       2
 1            1         0       3
 2            2         1       1
 3            3         1       3
 4            4         0       2

                                                 name  gender   age  sibsp  \
 0                     Wheeler, Mr. Edwin Frederick""    male   NaN      0
 1                                 Henry, Miss. Delia  female   NaN      0
 2  Hays, Mrs. Charles Melville (Clara Jennings Gr...  female  52.0      1
 3       Andersson, Mr. August Edvard ("Wennerstrom")    male  27.0      0
 4                                  Hold, Mr. Stephen    male  44.0      1

    parch         ticket     fare cabin embarked
 0      0  SC/PARIS 2159  12.8750   NaN        S
 1      0         382649   7.7500   NaN        Q
 2      1          12749  93.5000   B69        S
 3      0         350043   7.7958   NaN        S
 4      0          26707  26.0000   NaN        S  ,
    passengerid  pclass                                        name  gender  \
 0          916       3                 McGowan, Miss. Anna "Annie"  female
 1          917       2                         Pinsky, Mrs. (Rosa)  female
 2          918       3           McCarthy, Miss. Catherine Katie""  female
 3          919       3      Franklin, Mr. Charles (Charles Fardon)    male
 4          920       1  Wick, Mrs. George Dennick (Mary Hitchcock)  female

     age  sibsp  parch              ticket      fare cabin embarked
 0  15.0      0      0              330923    8.0292   NaN        Q
 1  32.0      0      0              234604   13.0000   NaN        S
 2   NaN      0      0              383123    7.7500   NaN        Q
 3   NaN      0      0  SOTON/O.Q. 3101314    7.2500   NaN        S
 4  45.0      1      1               36928  164.8667   NaN        S  )

In [1349]:
test.head()

,passengerid,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,916,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
1,917,2,"Pinsky, Mrs. (Rosa)",female,32.0,0,0,234604,13.0000,NaN,S
2,918,3,"McCarthy, Miss. Catherine Katie""""",female,NaN,0,0,383123,7.7500,NaN,Q
3,919,3,"Franklin, Mr. Charles (Charles Fardon)",male,NaN,0,0,SOTON/O.Q. 3101314,7.2500,NaN,S
4,920,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S

# 성별과 나이에 따른 기초대사량

https://www.joongang.co.kr/article/3564449#home

0~2 : 700 / 700
3~5 : 900 / 860
6~8 : 1090 / 100
9~11 : 1290 / 1180
12~14 : 1480 / 1340
15~17 : 1610 / 1300
18~29 : 1550 / 1210
30~49 : 1500 / 1170
50~69 : 1350 / 1110
70~ : 1220 / 1010

In [1350]:
def age_gender_change(age=None, gender=None):
    if (age>=0 and age<3 and gender=='male'):
        cal=700
        return cal
    elif (age>=0 and age<3 and gender=='female'):
        cal=700
        return cal
    elif (age>=3 and age<6 and gender=='male'):
        cal=900
        return cal
    elif (age>=3 and age<6 and gender=='female'):
        cal=860
        return cal
    elif (age>=6 and age<9 and gender=='male'):
        cal=1090
        return cal
    elif (age>=6 and age<9 and gender=='female'):
        cal=1000
        return cal
    elif (age>=9 and age<12 and gender=='male'):
        cal=1290
        return cal
    elif (age>=9 and age<12 and gender=='female'):
        cal=1180
        return cal
    elif (age>=12 and age<15 and gender=='male'):
        cal=1480
        return cal
    elif (age>=12 and age<15 and gender=='female'):
        cal=1340
        return cal
    elif (age>=15 and age<18 and gender=='male'):
        cal=1610
        return cal
    elif (age>=15 and age<18 and gender=='female'):
        cal=1300
        return cal
    elif (age>=18 and age<30 and gender=='male'):
        cal=1550
        return cal
    elif (age>=18 and age<30 and gender=='female'):
        cal=1210
        return cal
    elif (age>=30 and age<50 and gender=='male'):
        cal=1500
        return cal
    elif (age>=30 and age<50 and gender=='female'):
        cal=1170
        return cal
    elif (age>=50 and age<70 and gender=='male'):
        cal=1350
        return cal
    elif (age>=50 and age<70 and gender=='female'):
        cal=1110
        return cal
    elif (age>=70 and gender=='male'):
        cal=1220
        return cal
    else:
        cal=1010
        return cal

In [1351]:
print(age_gender_change(age=o_train['age'][1], gender='male'))

1550

In [1352]:
o_train['cal'] = o_train.apply(lambda x: age_gender_change(age=x['age'], gender=x['gender']), axis=1)
o_test['cal'] = o_test.apply(lambda x: age_gender_change(age=x['age'], gender=x['gender']), axis=1)

# Scaling

In [1353]:
scaling_cols = ['fare', 'cal', 'age']

x_tr = o_train[scaling_cols]
y_tr = o_train['survived']

x_te = o_test[scaling_cols]
x_tr.shape, y_tr.shape, train.shape, test.shape

((916, 3), (916,), (916, 12), (393, 11))

In [1354]:
x_tr.isnull().sum().sum(), x_te.isnull().sum().sum()

(0, 0)

In [1355]:
from sklearn.preprocessing import PowerTransformer
ptf = PowerTransformer()
#ptf.fit(x_tr)
#x_train_scaled = ptf.transform(x_tr)
#x_test_scaled = ptf.transform(x_te)

from sklearn.preprocessing import QuantileTransformer
qtf = QuantileTransformer()
qtf.fit(x_tr)
x_train_scaled = qtf.transform(x_tr)
x_test_scaled = qtf.transform(x_te)

from sklearn.preprocessing import StandardScaler
std = StandardScaler()
#std.fit(x_tr)
#x_train_scaled = std.transform(x_tr)
#x_test_scaled = std.transform(x_te)

from sklearn.preprocessing import MinMaxScaler
mas = MinMaxScaler()
#mas.fit(x_tr)
#x_train_scaled = mas.transform(x_tr)
#x_test_scaled = mas.transform(x_te)

from sklearn.preprocessing import RobustScaler
rbs = RobustScaler()
#x_train_scaled = rbs.fit_transform(x_tr)
#x_test_scaled = rbs.transform(x_te)

from sklearn.preprocessing import MaxAbsScaler
mas = MaxAbsScaler()
#mas.fit(x_tr)
#x_train_scaled = mas.transform(x_tr)
#x_test_scaled = mas.transform(x_te)

In [1356]:
x_tr=pd.DataFrame(x_train_scaled, columns=scaling_cols).reset_index(drop=True)
x_te=pd.DataFrame(x_test_scaled, columns=scaling_cols).reset_index(drop=True)
x_te.shape

(393, 3)

In [1357]:
x_tr.isnull().sum().sum(), x_te.isnull().sum().sum()

(0, 0)

# Encoding

## Onehot Encoding

In [1358]:
encoder = ce.OneHotEncoder(use_cat_names=True)
encoding_cols1 = ['gender']

x_tr1 = o_train[encoding_cols1]
x_te1 = o_test[encoding_cols1]

In [1359]:
#from sklearn.preprocessing import LabelEncoder
#encoder = LabelEncoder()
#x_train_scaled['columns_encoded'] = encoder.fit_transform(x_train_scaled['column'])
#x_train_scaled.head()


#encoder = ce.TargetEncoder()
#df_encoded = encoder.fit_transform(df['Column'], df['O/P'])
#df['encoded'] = df_encoded['Column']
#df['Rank'] = df['encoded'].rank(method = 'dense', ascending = False)


#encoder = ce.OrdinalEncoder(cols = 'color')
#df_encoded=encoder.fit_transform(df)
#df_encoded.head()

In [1360]:
encoder = ce.OneHotEncoder(use_cat_names=True)

enco_tr = pd.DataFrame()
enco_te = pd.DataFrame()

for col in x_tr1.columns:
  _enco = encoder.fit_transform(x_tr1[col].astype('category'))
  enco_tr = pd.concat([enco_tr, _enco], axis=1)

  _enco = encoder.transform(x_te1[col].astype('category'))
  enco_te = pd.concat([enco_te, _enco], axis=1)

print(f'{enco_tr.shape} / {enco_te.shape}')
enco_tr.columns

(916, 2) / (393, 2)

Index(['gender_male', 'gender_female'], dtype='object')

In [1361]:
x_tr1 = x_tr1.reset_index(drop=True)
x_te1 = x_te1.reset_index(drop=True)
enco_tr = enco_tr.reset_index(drop=True)
enco_te = enco_te.reset_index(drop=True)

x_tr1.shape, enco_tr.shape

((916, 1), (916, 2))

In [1362]:
encoding_tr1 = pd.concat([x_tr1,enco_tr],axis=1).reset_index(drop=True)
encoding_te1 = pd.concat([x_te1,enco_te],axis=1).reset_index(drop=True)

print(f'{encoding_tr1.shape} / {encoding_te1.shape}')
encoding_tr1.columns

(916, 3) / (393, 3)

Index(['gender', 'gender_male', 'gender_female'], dtype='object')

## Ordinal Encoding

In [1363]:
encoding_cols2 = ['pclass', 'sibsp', 'parch']
encoder = ce.OrdinalEncoder(cols = encoding_cols2)

x_tr2 = o_train[encoding_cols2]
x_te2 = o_test[encoding_cols2]

x_tr2.columns

Index(['pclass', 'sibsp', 'parch'], dtype='object')

In [1364]:
enco_tr = encoder.fit_transform(x_tr2)
enco_te = encoder.transform(x_te2)

In [1365]:

x_tr2 = x_tr2.reset_index(drop=True)
x_te2 = x_te2.reset_index(drop=True)
enco_tr = enco_tr.reset_index(drop=True)
enco_te = enco_te.reset_index(drop=True)

encoding_tr2 = pd.concat([x_tr2,enco_tr],axis=1).reset_index(drop=True)
encoding_te2 = pd.concat([x_te2,enco_te],axis=1).reset_index(drop=True)

x_te.isnull().sum(), encoding_te1.isnull().sum(), encoding_te2.isnull().sum()

(fare    0
 cal     0
 age     0
 dtype: int64,
 gender           0
 gender_male      0
 gender_female    0
 dtype: int64,
 pclass    0
 sibsp     0
 parch     0
 pclass    0
 sibsp     0
 parch     0
 dtype: int64)

## Target Encoding

In [1366]:
encoding_cols3 = ['cabin', 'embarked']
encoder = ce.TargetEncoder()

x_tr3 = o_train[encoding_cols3]
x_te3 = o_test[encoding_cols3]
target_tr = o_train['survived']

In [1367]:
enco_tr = encoder.fit_transform(x_tr3.reset_index(drop=True), target_tr.reset_index(drop=True))
enco_te = encoder.transform(x_te3)

x_tr3 = x_tr3.reset_index(drop=True)
x_te3 = x_te3.reset_index(drop=True)
enco_tr = enco_tr.reset_index(drop=True)
enco_te = enco_te.reset_index(drop=True)

encoding_tr3 = pd.concat([enco_tr],axis=1).reset_index(drop=True)
encoding_te3 = pd.concat([enco_te],axis=1).reset_index(drop=True)

In [1368]:
encoding_tr3.isnull().sum(), encoding_te3.isnull().sum()

(cabin       0
 embarked    0
 dtype: int64,
 cabin       0
 embarked    0
 dtype: int64)

gender / age => height, weight

In [1369]:
x_tr4=o_train[['age', 'gender']]
x_te4=o_test[['age', 'gender']]

x_tr4 = x_tr4.groupby('age')
x_te4 = x_te4.groupby('age')
x_tr4.head()

          age  gender
0    29.69837    male
1    29.69837  female
2    52.00000  female
3    27.00000    male
4    44.00000    male
..        ...     ...
889   0.92000    male
890   3.00000  female
898  32.50000    male
910  12.00000    male
915  53.00000  female

[327 rows x 2 columns]

# Scaling Enncoding DataFrame 합치기

In [1370]:
df_tr = pd.concat([x_tr, encoding_tr1, encoding_tr2, encoding_tr3],axis=1).reset_index(drop=True)
df_te = pd.concat([x_te, encoding_te1, encoding_te2, encoding_te3],axis=1).reset_index(drop=True)
df_tr.drop(encoding_cols1, inplace=True, axis=1)
df_te.drop(encoding_cols1, inplace=True, axis=1)
df_te.isnull().sum()

fare             0
cal              0
age              0
gender_male      0
gender_female    0
pclass           0
sibsp            0
parch            0
pclass           0
sibsp            0
parch            0
cabin            0
embarked         0
dtype: int64

In [1371]:
y = o_train['survived']

# train_test_split

In [1372]:
from sklearn.model_selection import train_test_split

X_tr, X_te, y_tr, y_te = train_test_split(df_tr, y, test_size=0.2, stratify=o_train['survived'], random_state=21)

In [1373]:
X_tr['cabin'].dtypes

dtype('float64')

In [1374]:
X_tr.isnull().sum().sum(), X_te.isnull().sum().sum(), y_tr.isnull().sum().sum(), y_te.isnull().sum().sum(), X_tr.shape, y_te.shape

(0, 0, 0, 0, (732, 13), (184,))

# Decision Tree Classifier

In [1383]:
test = pd.concat([df_te, o_test['passengerid']],axis=1).reset_index(drop=True)
test.set_index(['passengerid'], inplace=True)
test.shape

(393, 13)

In [1384]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import roc_curve, auc 
dt = DecisionTreeClassifier(random_state=21)
dt.fit(X_tr, y_tr)

test_pred_dt = dt.predict_proba(test)[:,1]

# Random Forest

In [1385]:
from sklearn.ensemble import RandomForestClassifier

rf = RandomForestClassifier(random_state=21)
rf.fit(X_tr, y_tr)

test_pred_rf = rf.predict_proba(test)[:, 1]

# 점수확인

In [1388]:
# Decision Tree
pred = dt.predict_proba(X_te)[:, 1]
fpr, tpr, _ = roc_curve(y_te, pred) 
auc(fpr, tpr)

0.8088972431077694

In [1389]:
# Random Forest
pred = rf.predict_proba(X_te)[:, 1]
fpr, tpr, _ = roc_curve(y_te, pred) 
auc(fpr, tpr)

0.8973684210526316

# 결과 저장

In [1390]:
# 변수명, 파일명 수정
submission = pd.read_csv("C:\project\datapre\.venv\Data Engineering\Data\kaggle_competition\\submission.csv")
submission['survived'] = test_pred_rf

submission.head()

   passengerid  survived
0          916  0.810000
1          917  0.940000
2          918  1.000000
3          919  0.011667
4          920  0.910000

In [1382]:
submission.to_csv("C:\project\datapre\.venv\Data Engineering\Data\kaggle_competition\\submission0222_1.csv", header=True, index = False)